miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_usb_basic/src/driver/r_usb_hlibusbip.c
            /* Get value for Interval Error Detection Interval  */
            pipe_peri = usb_hstd_get_pipe_peri_value (speed, descriptor[USB_EP_B_INTERVAL]);

        break;

        default:
            return USB_NULL;   /* Error */
        break;
    }

    /* Check Pipe no. */
    if (USB_NULL != pipe_no)
    {
        /* Endpoint number set */
        pipe_cfg    |= (uint16_t)(descriptor[USB_EP_B_ENDPOINTADDRESS] & USB_EP_NUMMASK);

        /* set max packet size */
        pipe_maxp   =  (uint16_t)descriptor[USB_EP_B_MAXPACKETSIZE_L] | (address << USB_DEVADDRBIT);
        pipe_maxp   |= ((uint16_t)descriptor[USB_EP_B_MAXPACKETSIZE_H] << 8);

        /* Store PIPE reg set value. */
        pipe_table_work->pipe_cfg  = pipe_cfg;
        pipe_table_work->pipe_maxp = pipe_maxp;
        pipe_table_work->pipe_peri = pipe_peri;
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        if (USB_IP1 == ip_no)
        {   /* PIPEBUF is USBA module only */
            pipe_buf = usb_cstd_get_pipe_buf_value(pipe_no);
            pipe_table_work->pipe_buf  = pipe_buf;
        }
#endif /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
    }
    return (pipe_no);
} /* eof usb_hstd_make_pipe_reg_info() */

/******************************************************************************
Function Name   : usb_hstd_clr_pipe_table
Description     : Clear pipe table.
Arguments       : uint16_t ip_no          : USB Module no.(USB_IP0/USB_IP1)
                : uint16_t device_address : USB Device address
Return value    : none
******************************************************************************/
void usb_hstd_clr_pipe_table (uint16_t ip_no, uint16_t device_address)
{
    uint8_t pipe_no;

    /* Search use pipe block */
    for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO +1); pipe_no++)
    {   /* Check use block */
        if (USB_TRUE == g_usb_pipe_table[ip_no][pipe_no].use_flag)
        {   /* Check USB Device address */
            if ((device_address << USB_DEVADDRBIT) == (g_usb_pipe_table[ip_no][pipe_no].pipe_maxp & USB_DEVSEL))
            {   /* Clear use block */
                g_usb_pipe_table[ip_no][pipe_no].use_flag = USB_FALSE;
                g_usb_pipe_table[ip_no][pipe_no].pipe_cfg = USB_NULL;
                g_usb_pipe_table[ip_no][pipe_no].pipe_maxp = USB_NULL;
                g_usb_pipe_table[ip_no][pipe_no].pipe_peri = USB_NULL;
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
                if (USB_IP1 == ip_no)
                {   /* PIPEBUF is USBA module only */
                    g_usb_pipe_table[ip_no][pipe_no].pipe_buf = USB_NULL;
                }
#endif /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
            }
        }
    }

} /* eof usb_hstd_clr_pipe_table() */

/******************************************************************************
Function Name   : usb_hstd_set_pipe_reg
Description     : Set up USB registers to use specified pipe (Pipe unit).
Arguments       : usb_utr_t *ptr          : Pointer to usb_utr_t structure.
                : uint16_t pipe_no        : USB Pipe No.
Return value    : none
******************************************************************************/
void usb_hstd_set_pipe_reg (usb_utr_t *ptr, uint16_t pipe_no)
{
    uint16_t buf;

    /* Check use block */
    if (USB_TRUE == g_usb_pipe_table[ptr->ip][pipe_no].use_flag)
    {
        /* Current FIFO port Clear */
        buf = hw_usb_read_fifosel(ptr, USB_CUSE);
        if ((buf & USB_CURPIPE) == pipe_no)
        {
            usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_CUSE, USB_FALSE);
        }
        buf = hw_usb_read_fifosel( ptr, USB_D0DMA );
        if ((buf & USB_CURPIPE) == pipe_no)
        {
            usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_D0USE, USB_FALSE);
        }
        buf = hw_usb_read_fifosel( ptr, USB_D1DMA );
        if ((buf & USB_CURPIPE) == pipe_no)
        {
            usb_cstd_chg_curpipe(ptr, (uint16_t) USB_PIPE0, (uint16_t) USB_D1USE, USB_FALSE);
        }

        /* PIPE Setting */
        usb_cstd_pipe_init (ptr, pipe_no);
    }
} /* eof usb_hstd_set_pipe_reg() */

/******************************************************************************
Function Name   : usb_hstd_get_pipe_no
Description     : Get PIPE No.
Arguments       : uint16_t ip_no     : USB Module no.(USB_IP0/USB_IP1)
                : uint16_t address   : USB Device address
                : uint16_t class     : USB Device class(USB_HVND/USB_HCDC/USB_HHID/USB_HMSC/USB_HUB)
                : uint8_t  type      : Transfer Type.(USB_EP_BULK/USB_EP_INT)
                : uint8_t  dir       : (USB_PIPE_DIR_IN/USB_PIPE_DIR_OUT)
Return value    : Pipe no (USB_PIPE1->USB_PIPE9:OK, USB_NULL:Error)
******************************************************************************/
uint8_t usb_hstd_get_pipe_no (uint16_t ip_no, uint16_t address, uint16_t usb_class, uint8_t type, uint8_t dir)
{
    uint8_t     pipe_no = USB_NULL;
#if defined(USB_CFG_HVND_USE)
    uint16_t    pipe;
#endif /* defined(USB_CFG_HVND_USE) */
#if defined(USB_CFG_HMSC_USE)
    uint16_t    side;
#endif /* defined(USB_CFG_HMSC_USE) */

    switch (usb_class)
    {
        case USB_HVND:
#if defined(USB_CFG_HVND_USE)
            if (USB_EP_BULK == type)
            {   /* BULK PIPE Loop */
                for (pipe = USB_BULK_PIPE_START; pipe < (USB_BULK_PIPE_END +1); pipe++)
                {
                    if (USB_FALSE == g_usb_pipe_table[ip_no][pipe].use_flag)
                    {   /* Check Free pipe */
                        pipe_no = pipe; /* Set Free pipe */
                        break;
                    }
                }
            }
            if (USB_EP_INT == type)
            {   /* Interrupt PIPE Loop */
                for (pipe = USB_INT_PIPE_START; pipe < (USB_INT_PIPE_END +1); pipe++)
                {
                    if (USB_FALSE == g_usb_pipe_table[ip_no][pipe].use_flag)
                    {   /* Check Free pipe */
                        pipe_no = pipe; /* Set Free pipe */
                        break;
                    }
                }
            }

#endif /* defined(USB_CFG_HVND_USE) */
        break;

        case USB_HCDC:
#if defined(USB_CFG_HCDC_USE)
            if (USB_EP_BULK == type)
            {
                if (USB_PIPE_DIR_IN == dir)
                {
                    switch (address)
                    {
                        case 1: /* Root port device1 */
                        case 2: /* Hub downport device1 */
                            pipe_no     = USB_CFG_HCDC_BULK_IN;
                        break;
                        case 3:/* Hub downport device2 */
                            pipe_no     = USB_CFG_HCDC_BULK_IN2;
                        break;
                        default:
                        break;
                    }
                }
                else
                {
                    switch (address)
                    {
                        case 1: /* Root port device1 */
                        case 2: /* Hub downport device1 */
                            pipe_no     = USB_CFG_HCDC_BULK_OUT;
                        break;
                        case 3:/* Hub downport device2 */
                            pipe_no     = USB_CFG_HCDC_BULK_OUT2;
                        break;
                        default:
                        break;
                    }
                }
            }
            if (USB_EP_INT == type)
            {
                if (USB_PIPE_DIR_IN == dir)
                {
                    switch (address)
                    {
                        case 1: /* Root port device1 */
                        case 2: /* Hub downport device1 */
                            pipe_no     = USB_CFG_HCDC_INT_IN;
                        break;
                        case 3:/* Hub downport device2 */
                            pipe_no     = USB_CFG_HCDC_INT_IN2;
                        break;
                        default:
                        break;
                    }
                }
            }
#endif /* defined(USB_CFG_HCDC_USE) */
        break;

